// ---------------------- 开发环境下配置 ----------------------
let dev_Url = {
  baseUrl : "http://192.168.2.61:8081",

  servierUrl  : "http://10.64.39.201:8001",                    // 后台服务接口地址

  authUrl : "http://10.64.39.99:10011/authorize-test", // 权限系统接口地址
};

// ---------------------- 生产环境下配置 ----------------------
let prod_Url = {
  baseUrl : "http://192.168.2.61:8081",

  servierUrl : "http://80.5.32.78:8001/",                    // 后台服务接口地址

  authUrl : "http://10.64.39.99:10011/authorize-test", // 权限系统接口地址
};

// ---------------------- 测试环境下配置 ----------------------
let test_Url = {
  baseUrl : "http://192.168.2.61:8081",

  servierUrl  : "http://80.5.32.78:8001/",                    // 后台服务接口地址

  authUrl : "http://10.64.39.99:10011/authorize-test",       // 权限系统接口地址
};


/* 根据环境 ，选择不同url对象导出 */
export default dev_Url;


